Repository: 84000/data-translation-memory
Catalog: toh64-v3.tmx
Source language: bo
Languages: en

source: ཀླུའི་རྒྱལ་པོ་དེ་བདག་གིས་ཆུ་བོ་འདི་དག་ཕྱུང་ངོ་། །དབྱུང་བར་བྱའོ་སྙམ་དུ་མི་སེམས་མོད་ཀྱི།
en: The nāga king himself releases these rivers, but he does not think, ‘I shall release the rivers.’

source: འོན་ཀྱང་ཆུ་ཀླུང་བཞི་པོ་དག་རྟག་ཏུ་འབབ་ཅིང་སེམས་ཅན་རྣམས་ཉེ་བར་སྤྱོད་པར་བྱེད་དོ། །
en: Nevertheless, the four great rivers flow continuously and benefit sentient beings.

source: བྱང་ཆུབ་སེམས་དཔའ་ཡང་དེ་བཞིན་དུ་སྔོན་གྱི་སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པར་གྱུར་པའི་དབང་གིས་རྩོལ་བ་མེད་པའི་ཡེ་ཤེས་ཀྱིས་འཕགས་པའི་བདེན་པ་བཞི་བསྟན་ནས་འཁོར་བའི་ཡོངས་སུ་གདུང་བ་ཐམས་ཅད་བསལ་ཏེ་ལྷ་དང་མི་རྣམས་ལ་འཕགས་པའི་རྣམ་པར་གྲོལ་བའི་བདེ་བ་སྦྱིན་པར་བྱེད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་དེ་བདག་གིས་ཆོས་བསྟན་ཏོ། །
en: Bodhisattvas, similarly, since they have fulfilled their former vows, teach the four truths of the noble ones by means of their effortless wisdom. They dispel all the torments of saṃsāra and bestow the happiness of noble liberation.

source: བསྟན་པར་བྱའོ་སྙམ་དུ་མི་སེམས་མོད་ཀྱི།
en: But the bodhisattvas do not think, ‘I have taught the Dharma,’ or ‘I shall teach it.’

source: འོན་ཀྱང་རང་གི་ངང་གིས་སྙིང་རྗེ་ཆེན་པོའི་བསམ་པ་ལ་གནས་ནས་སེམས་ཅན་རྣམས་ལ་སོ་སོར་བརྟགས་ཏེ་ཅི་རིགས་པར་ཆོས་སྟོན་པར་བྱེད་དོ། །
en: Nevertheless, they spontaneously dwell in their own thought of great compassion, and, having analyzed sentient beings, they teach them the Dharma in whatever way is suitable.

source: གཞན་ཡང་གློག་ཐོབ་འདི་ལྟ་སྟེ་དཔེར་ན་བརྒྱ་བྱིན་ལྷའི་དབང་པོ་ལ་ལྷའི་བུ་མོ་ཁྲག་ཁྲིག་ཕྲག་བཅུ་གཉིས་ཡོད་པ་དེ་དག་བརྒྱ་བྱིན་ལྷའི་དབང་པོའི་རང་དབང་གི་མཐུའི་དབང་གིས་ལུས་མང་པོ་བསྟན་ནས་ལྷའི་བུ་མོ་དེ་དག་དེ་དང་ལྷན་ཅིག་འདོད་པའི་བདེ་བ་ཡོངས་སུ་རྫོགས་པར་མྱོང་བས་དེ་དག་སོ་སོ་ནས་འདི་སྙམ་དུ་བདག་གཅིག་པུ་ནི།
en: “Vidyutprāpta, to give another analogy, Śakra, king of the gods, has twelve billion apsaras. By means of Śakra’s autonomous power, he displays many bodies, and the apsaras all enjoy sexual pleasure with him.

source: དེང་ལྷའི་དབང་པོ་དང་ལྷན་ཅིག་རྩེས་སོ་སྙམ་དུ་སེམས་ཀྱང་ཡང་དག་པར་ལྷའི་དབང་པོ་དེ་ལ་མངོན་པར་ཞེན་པར་གྱུར་པ་ཅི་ཡང་མེད་དོ། །
en: Individually they think, ‘Only I am frolicking with the king of the gods,’ while, in fact, the king of the gods has no attachment whatsoever.

source: བྱང་ཆུབ་སེམས་དཔའ་ཡང་དེ་བཞིན་དུ་སེམས་ཅན་གང་ཡོངས་སུ་བཟླ་བའི་འོས་སུ་གྱུར་པ་དེ་དག་གི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་སྨིན་པར་བྱེད་ཀྱང་། བྱང་ཆུབ་སེམས་དཔའ་ལ་མངོན་པར་ཞེན་པར་གྱུར་པ་མེད་དོ། །
en: In the same way, the bodhisattvas, too, in accordance with the wishes of whichever sentient beings are worthy of completely passing beyond, mature them, while the bodhisattvas have no attachment.

source: གཞན་ཡང་གློག་ཐོབ་འདི་ལྟ་སྟེ་དཔེར་ན་ཉི་མའི་དཀྱིལ་འཁོར་རི་མཐོན་པོའི་རྩེ་མོ་ལ་ཤར་བའི་ཚེ་འོད་ཀྱིས་འཛམ་བུའི་གླིང་ཀུན་དུ་སྣང་བར་བྱེད་པས་གང་དུ་སྣང་བར་བྱས་པའི་གནས་དེ་དག་ཏུ་ཁ་དོག་སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་རྣམ་པ་སྣ་ཚོགས་རབ་ཏུ་སྟོན་པར་བྱེད་ཀྱང་ཉི་མའི་དཀྱིལ་འཁོར་དེ་ནི་ཁ་དོག་གཅིག་པ།
en: “Vidyutprāpta, to give another analogy, when the orb of the sun appears at the top of a mountain, its light illuminates Jambudvīpa, and whatever place it illuminates, it reveals various colors—blue, yellow, red, white—while the orb of the sun itself is a single color.

source: འོད་གཅིག་པ་ཉིད་དེ་ཐ་དད་པའི་མཚན་མ་མེད་དོ། །
en: The unity of the light has no differences in quality.

source: བྱང་ཆུབ་སེམས་དཔའ་ཡང་དེ་བཞིན་དུ་ཤེས་རབ་ཀྱི་ཉི་མའི་དཀྱིལ་འཁོར་གྱིས་ཆོས་ཀྱི་དབྱིངས་སྣང་བར་བྱས་ནས་སེམས་ཅན་གྱི་མངོན་པར་ཞེན་པའི་རིའི་རྩེ་མོ་དེ་དག་ཏུ་ཤར་བ་ན་དམིགས་པའི་མཚན་ཉིད་གཅིག་ཏུ་གྱུར་ཅིང་དེ་དག་གི་མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་སྟོན་པར་བྱེད་ཀྱང་། ཆོས་ཀྱི་དབྱིངས་ལ་གཉིས་སུ་གྱུར་པའི་མཚན་ཉིད་མེད་དེ།
en: Similarly, the bodhisattvas also, with the orb of the sun of wisdom, illuminate the dharmadhātu. They appear at the mountaintops of sentient beings’ attachments as a single objective image, and they teach them the Dharma according to their desires, even though the dharmadhātu has no dualistic nature.

source: གློག་ཐོབ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་འདོད་ཆགས་ཀྱི་སྤྱོད་པའི་གཏེར་ཅེས་བྱའོ། །
en: “Vidyutprāpta, this is the bodhisattva mahāsattvas’ treasure for those with a lustful temperament.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་གཏེར་འདི་ཐོབ་པར་གྱུར་ན་བསྐལ་པའམ། བསྐལ་པ་ལས་ལྷག་པར་སེམས་ཅན་རྣམས་ཀྱི་མོས་པ་སྣ་ཚོགས་ཇི་ལྟ་བ་བཞིན་དུ་ལུས་ཚད་མེད་པ་བསྟན་ནས་ཚིག་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་ཆོས་སྟོན་པར་བྱེད་ཀྱང་ཆོས་ཀྱི་དབྱིངས་ལ་གཉིས་སུ་གྱུར་པའི་མཚན་ཉིད་མེད་དོ། །
en: When bodhisattva mahāsattvas obtain this treasure, for a kalpa or more than a kalpa, they can display infinite bodies according to the various desires of sentient beings, even though the dharmadhātu has no dualistic nature.

source: གཞན་ཡང་གློག་ཐོབ་འདི་ལྟ་སྟེ་དཔེར་ན་གསེར་ཡང་དག་པ་ནི་མགར་བའི་ཐབས་མཁས་པའི་མཐུའི་དབང་གིས་མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྒྱན་རྣམ་པ་སྣ་ཚོགས་སུ་བྱས་ཏེ་མཚན་ཉིད་ཐ་དད་པར་གྱུར་ཀྱང་གསེར་གྱི་རང་བཞིན་ལ་ནི་ཐ་དད་དུ་གྱུར་པ་ཅི་ཡང་མེད་དོ། །
en: “Furthermore, Vidyutprāpta, to give another analogy, pure gold is made, due to the skill of a metalworker and according to his will, into various types of ornaments. Although the attributes change, the nature of gold does not change.

source: བྱང་ཆུབ་སེམས་དཔའ་ཡང་དེ་བཞིན་དུ་ཆོས་ཀྱི་དབྱིངས་ཤིན་ཏུ་ལེགས་པར་བརྟགས་ནས་སེམས་ཅན་མོས་པ་རྣམ་པ་སྣ་ཚོགས་ཇི་ལྟ་བ་བཞིན་དུ་ལུས་ཚད་མེད་པ་དག་བསྟན་ནས་ཚིག་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་ཆོས་སྟོན་པར་བྱེད་ཀྱང་ཆོས་ཀྱི་དབྱིངས་ལ་ནི་གཉིས་སུ་གྱུར་པའི་མཚན་ཉིད་མེད་དེ།
en: In the same way, the bodhisattva mahāsattvas also analyze the dharmadhātu very carefully, display infinite bodies to sentient beings according to their various wishes, and teach the Dharma in various words, even though the dharmadhātu has no dualistic nature.

source: འདི་ནི་རྟག་པར་ཆོས་ཀྱི་དབྱིངས་ལ་ཞུགས་པས་མཚན་ཉིད་གཅིག་ཏུ་གྱུར་པ་ཞེས་བྱའོ། །
en: Since they are constantly immersed in the dharmadhātu, this is called being integrated in the nature of the dharmadhātu.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་གཏེར་འདི་ལྟ་བུ་ཐོབ་པར་གྱུར་ན་སེམས་ཅན་གྱི་ཆེད་དུ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་སྒོ་ནས་ཆོས་སྟོན་པར་བྱེད་པས་དེ་དག་གིས་ཆོས་ཐོས་པའི་དབང་གིས་འཕགས་པའི་ནོར་ཕུན་སུམ་ཚོགས་པའི་དབང་ཕྱུག་དང་ལྡན་པར་གྱུར་པས་འཁོར་བའི་རྒུད་པ་དག་གཏན་དུ་ཡོངས་སུ་སྤོང་བར་བྱེད་དོ། །
en: When bodhisattvas obtain this sort of treasure, since they teach the Dharma in various ways for the sake of sentient beings, they, due to hearing the Dharma, come to possess sovereignty over the marvelous wealth of the noble ones and abandon forever the troubles of saṃsāra.

source: གཞན་ཡང་གློག་ཐོབ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཞེ་སྡང་སྤྱོད་པའི་གཏེར་ཞེས་བྱ་བ་ཇི་ལྟ་བུ་ཞེ་ན།
en: “Furthermore, Vidyutprāpta, what is the bodhisattva mahāsattvas’ treasure for those with an angry temperament?

source: འདི་ལྟ་སྟེ། སེམས་ཅན་རྣམས་ནི་ང་རྒྱལ་དང་མཚུངས་པར་ལྡན་པ། བདག་དང་བདག་གིར་འཛིན་པ་དང་བཅས་པ། བདག་དང་བདག་གི་མཚན་མ་ལ་གནས་པས་ཡུན་རིང་པོ་ནས་བྱམས་པ་དང་། བཟོད་པ་མ་བསྒོམས་པ།
en: Sentient beings have pride, conceive of ‘me’ and ‘mine,’ and do not practice compassion or patience since they have dwelt for a long time in characteristics of ‘me’ and ‘mine.’

source: ཞེ་སྡང་གི་གདུང་བས་རང་གི་སེམས་བཤིག་པར་གྱུར་པ། སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་རྗེས་སུ་དྲན་པར་མ་གྱུར་པ།
en: Their own minds are destroyed by the torment of anger; they do not remember the Buddha, the Dharma, and the Saṅgha; and they are covered with the poison of anger and are deluded about reality.

source: ཞེ་སྡང་གི་གདུག་པས་གཡོགས་པས་ཆོས་ཉིད་ལ་རྨོངས་པར་གྱུར་པ་ཡིན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཞེ་སྡང་མང་བའི་སེམས་ཅན་དེ་དག་ལ་ནམ་ཡང་གནོད་སེམས་དང་རྣམ་པར་འཚེ་བ་སྐྱེད་པར་མི་བྱེད་ཀྱི།
en: But the bodhisattvas never produce malice or hostility toward sentient beings who have much anger.

source: འདི་སྙམ་དུ་ཀྱེ་མ་སེམས་ཅན་འདི་དག་ནི་གཏི་མུག་གིས་རྨོངས་པས་ཆོས་རྣམས་གཟོད་མ་ཉིད་ནས་རབ་ཏུ་དབེན་ཞིང་ཞི་བ། དྲི་མ་དང་རྙོག་པ་མེད་པ། འདུམ་པ་མེད་པ། རྩོད་པ་མེད་པ། རབ་ཏུ་དབེན་པའི་ཆོས་ཉིད་ལ་ཕྱིན་ཅི་ལོག་དང་མཚུངས་པར་ལྡན་པར་གྱུར་པའི་དབང་གིས་ཡང་དག་པ་མ་ཡིན་པའི་ཞེ་སྡང་དང་།
en: They just think, ‘Alas, these sentient beings, since they are bewildered by ignorance, have increased their hatred and incorrect anger since they possess false notions regarding the true nature of dharmas, which are, from the beginning, quiescent, untainted and unsullied, peaceful and uncontentious, and completely void.’

source: འཁོན་དུ་འཛིན་པ་རྒྱས་པར་གྱུར་ཏོ་སྙམ་དུ་སེམས་པ་ཁོ་ནར་ཟད་དོ། །དེ་སྙམ་དུ་བསམས་ནས་ཀྱང་སྙིང་རྗེ་ཆེན་པོ་ལ་གནས་ཏེ་རྟག་པར་བདག་ཉིད་འགྱོད་ཅིང་བཤགས་པར་ཡང་བྱེད་ལ།
en: After thinking in that way and abiding in great compassion, they always show their pity.

source: གལ་ཏེ་ལུས་ཀྱི་ཡན་ལག་དང་ཉིང་ལག་གཅོད་པ་ཞིག་ཡོད་ན་ཡང་ཞེ་སྡང་སྤྱོད་པའི་སེམས་ཅན་དེ་དག་འདུལ་བར་འདོད་པའི་ཕྱིར་བཟོད་པ་ལ་རབ་ཏུ་གནས་པར་བྱེད་དོ། །
en: Even if there are some who cut off their limbs and smaller body parts, because they desire to tame those sentient beings who have angry temperaments, they abide in patience.

source: གལ་ཏེ་ཞེ་སྡང་སྤྱོད་པའི་སེམས་ཅན་ཚད་མེད་པ་དེ་དག་ཕན་ཚུན་གཅིག་ལ་གཅིག་རྒྱབ་ཀྱིས་ཕྱོགས་ཤིང་ཞེ་སྡང་དང་། འཁོན་དུ་འཛིན་པའི་ལས་ཡོངས་སུ་རྫོགས་པའི་དབང་གིས་སྦྲུལ་གདུག་པ་ངན་འགྲོའི་ལུས་སུ་ལྟུང་བར་གྱུར་པ་དག་ལ་ནི་བྱང་ཆུབ་སེམས་དཔའ་བཟོད་པ་ལ་རབ་ཏུ་གནས་པ་དེས་འདི་ལྟར་བྱམས་པ་དང་། དྲན་པའི་སྟོབས་ཀྱིས་སེམས་ཅན་དེ་དག་བཏུལ་ནས་ངན་འགྲོའི་རྣམ་པར་སྨིན་པ་ལེན་པར་མི་འགྱུར་ཞིང་།
en: If those uncountable sentient beings who have angry temperaments turn their backs on one another, due to having completed actions of anger and hatred, and fall into a body within a bad birth, such as a poisonous snake, the bodhisattvas, abiding in patience, tame those beings by means of their loving kindness and the force of their mindfulness, and they do not receive the retribution of a bad birth in the future.

source: གདོན་མི་ཟ་བར་མཉམ་པ་ཉིད་རྟོགས་པར་བྱེད་པ་གང་ཡིན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཐབས་མཁས་པས་སེམས་ཅན་གྱི་ཞེ་སྡང་གི་སྤྱོད་པ་ཡོངས་སུ་བསལ་བར་བྱེད་པ་ཞེས་བྱའོ། །
en: Whatever their undoubted realization of equality is, this is called the bodhisattvas’ complete elimination, by their skillful means, of sentient beings’ angry temperaments.

source: གཞན་ཡང་གློག་ཐོབ་བྱང་ཆུབ་སེམས་དཔའ་ནི་གལ་ཏེ་སེམས་ཅན་ཞེ་སྡང་ཅན་དག་མཐོང་བར་གྱུར་ན། འདི་སྙམ་དུ་ཆོས་ཐམས་ཅད་ནི་རང་བཞིན་གྱིས་རྣམ་པར་དག་པ་ཡིན་ན།
en: “Furthermore, Vidyutprāpta, if the bodhisattvas see angry sentient beings, they think, ‘As all dharmas are pure in their own nature, alas, these sentient beings are incorrect due to following their anger, and they develop wrong views.

source: ཀྱེ་མ་སེམས་ཅན་འདི་དག་ནི་ཞེ་སྡང་གི་རྗེས་སུ་འབྲངས་ནས་ཡང་དག་པ་མ་ཡིན་པས་རྣམ་པར་རྟོག་པ་བསྐྱེད་ནས་མཉམ་ཞིང་རྩོད་པ་མེད་པའི་ཆོས་ཉིད་འདི་ལ་ཞེ་སྡང་གི་བསམ་པ་བསྐྱེད་པས་སེམས་ཅན་འདི་དག་ཆོས་ཀྱི་དབྱིངས་ཉིད་མ་རྟོགས་པར་གྱུར་ཏོ། །
en: Since they produce a thought of anger with respect to the nature of dharmas as equal and uncontentious, these sentient beings do not understand the dharmadhātu itself.

source: གལ་ཏེ་སེམས་ཅན་འདི་དག་ཆོས་ཉིད་མཐོང་བར་གྱུར་ན་ནི་གཞན་དག་ལ་གནོད་སེམས་བསྐྱེད་པར་མི་འགྱུར་བ་ཞིག་ན།
en: If these sentient beings saw the nature of dharmas, they would not produce harmful thoughts toward others.

source: ཆོས་ཀྱི་དབྱིངས་ཀྱི་ངོ་བོ་ཉིད་མ་རྟོགས་པས་དེའི་ཕྱིར་ཞེ་སྡང་སྐྱེས་པར་གྱུར་ཏོ་ཞེས་བྱང་ཆུབ་སེམས་དཔའ་དེས་ཞེ་སྡང་མང་བའི་སེམས་ཅན་དེ་དག་ལ་ལྷག་པར་སྙིང་བརྩེ་བ་བསྐྱེད་ནས་སྙིང་རྗེ་ཆེན་པོ་ལ་གནས་ཏེ།
en: Due to the fact that they do not understand the essence of the dharmadhātu, anger arises.’ The bodhisattvas, having produced even more compassion toward those sentient beings who have much anger, dwell in great compassion.

source: སྔོན་གྱི་སྨོན་ལམ་ཡང་ཡོངས་སུ་རྫོགས་པར་བྱེད་ལ། རྩོལ་བ་མེད་པའི་ཡེ་ཤེས་ཀྱིས་སེམས་ཅན་གྱི་ཞེ་སྡང་གི་སྤྱོད་པ་རྣམ་པར་གཞིག་པའི་ཕྱིར་ཆོས་ཀྱི་སྒོ་མོ་རྣམ་པ་སྣ་ཚོགས་ཡང་དག་པར་སྟོན་པར་བྱེད་ཀྱང་བདག་གིས་སེམས་ཅན་གྱི་ཞེ་སྡང་བསལ་བའི་ཕྱིར་ཆོས་བསྟན་ཏོ་སྙམ་དུ་མི་སེམས་སོ། །
en: Again fulfilling their former vow, they correctly teach various Dharma doors for the sake of destroying, with their effortless wisdom, the angry actions of sentient beings without thinking, ‘I am teaching the Dharma for the purpose of removing sentient beings’ anger.’

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is that?

source: བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཀྱི་དབྱིངས་ཀྱི་མཚན་ཉིད་ཤིན་ཏུ་ལེགས་པར་རྟོགས་པའི་ཕྱིར་རོ། །
en: It is because the bodhisattvas understand very well the nature of the dharmadhātu.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་དབྱིངས་དབྱེར་མེད་པའི་མཚན་ཉིད་ལ་གནས་ནས་ཉོན་མོངས་པའི་སྤྱོད་པ་རབ་ཏུ་བསལ་བ་ཞེས་བྱའོ། །
en: As for this, it should be known that, since the bodhisattvas dwell in the undifferentiated nature of the dharmadhātu, they eradicate defiled actions.

source: གློག་ཐོབ་འདི་ལྟ་སྟེ། དཔེར་ན་མུན་པ་བསལ་ནས་སྣང་བ་འཐོབ་པར་འགྱུར་ཡང་མུན་པ་སེལ་བར་བྱེད་པ་མེད་དེ།
en: “Vidyutprāpta, to give an analogy, after darkness is removed, light is obtained, but darkness is not destroyed.

source: འདི་ལྟར་མུན་པ་དང་སྣང་བའི་ངོ་བོ་ཉིད་ནམ་མཁའ་དང་མཚུངས་ཤིང་དབྱེར་མེད་པ་ཡིན་ནོ། །
en: Thus, the essence of darkness and light is undifferentiated, like space.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་ཆོས་ཀྱི་དབྱིངས་དབྱེར་མེད་པའི་ཡེ་ཤེས་དེ་ལ་བརྟེན་ནས་ཐབས་མཁས་པས་ཆོས་བསྟན་ཏེ།
en: In the same way, the bodhisattvas, relying on their undifferentiated knowledge of the dharmadhātu, teach the Dharma with skillful means.

source: ཞེ་སྡང་སྤྱོད་པའི་སེམས་ཅན་རྣམ་པ་སྣ་ཚོགས་འདུལ་ཞིང་ཞི་བར་བྱེད་ཀྱང་ཆོས་ཀྱི་དབྱིངས་ལ་ཐ་དད་དུ་གྱུར་པ་མེད་དོ། །
en: Taming various sentient beings with angry temperaments, they pacify them, but there are no distinctions in the dharmadhātu.

source: གློག་ཐོབ་འདི་ལྟ་སྟེ་དཔེར་ན་ཉི་མའི་དཀྱིལ་འཁོར་ཤར་ནས་འོད་ཀྱིས་གང་དང་གང་དུ་སྣང་བར་བྱས་པ་དེ་དག་ཐམས་ཅད་ནི་ཉི་མའི་དཀྱིལ་འཁོར་གྱིས་བསྡུས་པ་ཡིན་ནོ། །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་ཞེ་སྡང་གི་སྤྱོད་པ་གདུལ་ཞིང་བསལ་བའི་ཕྱིར་ཇི་ཙམ་དུ་ཚིག་ཏུ་བརྗོད་པ་ཐམས་ཅད་ཆོས་ཀྱི་འཁོར་ལོ་ཡིན་ཡང་ཆོས་ཀྱི་དབྱིངས་ལ་ནི་ཐ་དད་དུ་གྱུར་པ་མེད་དོ། །
en: “Vidyutprāpta, to give an analogy, just as everywhere that the light from the rising wheel of the sun shines is all encompassed by the rising wheel of the sun, similarly, everything said by the bodhisattvas for the sake of taming and eradicating angry actions is all the wheel of Dharma, and there are no distinctions in the dharmadhātu.

source: འདི་ལྟར་ཞེ་སྡང་གི་སྤྱོད་པ་ཉི་ཁྲི་ཆིག་སྟོང་དང་། སྤྱོད་པ་གཞན་གཏོགས་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་དུ་གྱུར་པ་དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་རྩོལ་བ་མེད་པའི་ཡེ་ཤེས་ཡོངས་སུ་གྲུབ་པས་སེམས་ཅན་དེ་དག་གི་ཞེ་སྡང་གི་སྤྱོད་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་རྗེས་སུ་ཆོས་སྟོན་པར་བྱེད་ཀྱང་བདག་གིས་སེམས་ཅན་ལ་ཆོས་བསྟན་ཏོ། །སྟོན་ཏོ། །
en: Thus, as for those twenty-one thousand angry actions and actions belonging to the other categories of temperaments, amounting to eighty-four thousand in total, the bodhisattvas, since they have perfected effortless wisdom, teach the Dharma that is appropriate for sentient beings’ various types of anger, without thinking, ‘I have taught, I teach, and I shall teach the Dharma.’

source: སྟོན་པར་འགྱུར་རོ་སྙམ་དུ་སེམས་པ་མེད་དོ། །འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཞེ་སྡང་སྤྱོད་པའི་གཏེར་ཞེས་བྱའོ། །
en: This should be known as the treasure for those of angry temperaments.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་གཏེར་འདི་ཐོབ་པར་གྱུར་ན་བསྐལ་པ་འམ། བསྐལ་པ་ལས་ལྷག་པར་སེམས་ཅན་གྱི་མོས་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་རྗེས་སུ་ཚིག་འབྲུ་དང་། ཡི་གེ་དང་། བརྗོད་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་ཐབས་མཁས་པས་ཆོས་སྟོན་པར་བྱེད་ཀྱང་ཞེ་སྡང་སྤྱོད་པའི་མཐའ་རྙེད་པར་མི་འགྱུར་ལ།
en: When bodhisattvas obtain this treasure, for a kalpa or more than a kalpa, according to the various inclinations of sentient beings, they teach the Dharma with skill in means through various words, letters, and expressions.

source: བྱང་ཆུབ་སེམས་དཔའ་དེའི་ཤེས་རབ་དང་། སྤོབས་པ་ཡང་གཏུགས་པར་མི་འགྱུར་ཏེ།
en: Furthermore, although angry actions are endless, the bodhisattvas’ wisdom and courage also cannot be exhausted.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་དབྱིངས་དབྱེར་མེད་པའི་མཚན་ཉིད་ལེགས་པར་བཤད་པས་ཐོབ་པའི་ཞེ་སྡང་སྤྱོད་པའི་གཏེར་ཞེས་བྱའོ། །
en: As for this, it should be understood as the bodhisattvas’ treasure for those of angry temperaments, which they have obtained by explaining well the undifferentiated nature of the dharmadhātu.

source: གཞན་ཡང་གློག་ཐོབ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་གཏི་མུག་སྤྱོད་པའི་གཏེར་ཞེས་བྱ་བ་ཇི་ལྟ་བུ་ཞེ་ན།
en: “Furthermore, Vidyutprāpta, what is the bodhisattva mahāsattvas’ treasure for those with a deluded temperament?

source: གློག་ཐོབ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྱོད་པ་འདི་ལྟ་བུ་འདི་ནི་ཤིན་ཏུ་དཀའ་བའི་དངོས་པོ་ཡིན་ཏེ། འདི་ལྟར་སེམས་ཅན་རྣམས་ནི་ཉོན་མོངས་པའི་རྗེས་སུ་འབྲང་བ། གཞན་ལ་གནོད་པ་བྱེད་པ། མ་རིག་པའི་མངལ་གྱི་སྒོ་ངས་ཀུན་ཏུ་དཀྲིས་པ།
en: Vidyutprāpta, this sort of practice of the bodhisattvas is very difficult.

source: དར་གྱི་སྲིན་བུ་བཞིན་དུ་བདག་ཉིད་བཅིངས་པས་ཆོས་ཀྱི་དབྱིངས་རྟོགས་པའི་ཐབས་མེད་པ། བྱ་བ་དག་ལ་ལེགས་པར་སོ་སོར་མི་རྟོག་པ་བདག་ཏུ་ལྟ་བ་ལ་མངོན་པར་ཞེན་པ། ལམ་ལོག་པར་ཞུགས་པ། བྱིས་པའི་སྤྱོད་པ་ལ་གནས་པ།
en: Such sentient beings chase affliction, harm others, are wrapped in an eggshell of ignorance, have no way of understanding the dharmadhātu since they are bound up in themselves like silkworms, do not properly contemplate what they should do, are attached to a belief in the self, enter a wrong path, persist in foolish actions, and have difficulty renouncing saṃsāra.

source: ངེས་པར་འབྱུང་བ་དཀའ་བ་ཡིན་པས་འདི་ལྟ་བུ་ལ་སོགས་པས་རྨོངས་པར་གྱུར་པའི་སེམས་ཅན་དག་གི་ཆེད་དུ་དང་པོ་སེམས་བསྐྱེད་པ་ནས་སྦྱོར་བ་ཆེན་པོ་བསྐྱེད་དེ། ངལ་ཞིང་སྡུག་བསྔལ་བ་ཡང་མེད། ལེ་ལོ་ཡང་མེད་པར་རྐྱེན་གང་དང་། མོས་པ་གང་དང་། ཆོས་བསྟན་པ་ཇི་ལྟ་བུ་ཞིག་གིས་སེམས་ཅན་འདི་དག་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བཙུད་དེ་རྣམ་པར་གྲོལ་བ་ཐོབ་པར་འགྱུར་སྙམ་དུ་སེམས་ཏེ།
en: “Since they are like this, for the sake of sentient beings who are deluded, after the bodhisattvas first generate the thought of enlightenment, they tirelessly generate a great effort, without suffering and without laziness, and they think about the conditions in which, the conviction with which, and the kind of doctrinal teaching with which they can lead these sentient beings to the bodhisattva practice so that they may obtain liberation.

source: བྱང་ཆུབ་སེམས་དཔའ་སྔོན་ཆོས་ཀྱི་དབྱིངས་ལེགས་པར་སོ་སོར་བརྟགས་པར་རྩོལ་བ་མེད་པའི་ཡེ་ཤེས་ཀྱིས་སྙིང་རྗེ་ཆེན་པོ་ལ་གནས་ཏེ།
en: “The bodhisattvas, having previously penetrated the dharmadhātu, abide in great compassion by means of their effortless wisdom.

source: སེམས་ཅན་དེ་དག་ཆོས་ཀྱི་དབྱིངས་ལ་རྨོངས་པར་གྱུར་པར་རིག་ནས་ཅི་ནུས་ཅི་ལྕོགས་ཀྱིས་ཆོས་བསྟན་ནས་རབ་ཏུ་དུལ་བར་བྱེད་ཀྱང་བདག་གིས་ཆོས་བསྟན་ཏོ། །སྟོན་ཏོ། །སྟོན་པར་འགྱུར་རོ་སྙམ་དུ་སེམས་པ་མེད་དེ།
en: After they understand that those sentient beings are confused regarding the dharmadhātu, having taught them Dharma according to their power and ability, they train them completely, without thinking, ‘I taught, I teach, and I shall teach the Dharma.’

source: འོན་ཀྱང་དེའི་སྔོན་གྱི་སྨོན་ལམ་གྱི་མཐུས་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལེགས་པར་སོ་སོར་བརྟགས་ནས་རང་གི་ངང་གིས་ཆོས་ཀྱི་སྒོ་མོ་བརྒྱ་སྟོང་དུ་མ་བསྟན་ཏེ། སེམས་ཅན་དེ་དག་གི་མ་རིག་པའི་ལས་ཀྱི་འདུ་བྱེད་བསལ་ནས་རྣམ་པར་གྲོལ་བ་འཐོབ་པར་བྱེད་དོ། །
en: However, by the power of their former vow, having thoroughly contemplated conditioned origination, they spontaneously reveal many hundreds of thousands of Dharma doors and remove those sentient beings’ ignorance-based karmic activity and make them attain liberation.

source: གློག་ཐོབ་འདི་ལྟ་སྟེ་དཔེར་ན་སྨན་པ་བཟང་པོ་ནད་མང་པོ་གསོ་བ་ལ་མཁས་པ།
en: “Vidyutprāpta, to give an analogy, it is like this. A good physician is skilled in curing many illnesses.

source: སྔར་སྨན་དཔྱད་རྣམས་ལ་ཤིན་ཏུ་གོམས་པར་གྱུར་པ་ནི་ནད་ཀྱི་མཚན་མ་མཐོང་མ་ཐག་ཏུ་སྔགས་དང་སྨན་བཏང་བ་ཐམས་ཅད་རབ་ཏུ་རྟོགས་པར་གྱུར་པས་དེས་གསོས་པ་གང་ཡང་མི་སོས་པ་མེད་དོ། །
en: He has previously become familiar with medical treatments, and as soon as he sees the symptoms of a disease, since he knows all the mantras and medical treatments, he cures it; there is nothing that he cannot cure.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་འདི་ལྟར་ཆོས་ཀྱི་དབྱིངས་ཤིན་ཏུ་ལེགས་པར་རྟོགས་པས་རྩོལ་བ་མེད་པའི་ཡེ་ཤེས་ཀྱིས་གཏི་མུག་གི་སྤྱོད་པ་བསགས་པའི་སེམས་ཅན་དེ་དག་གི་དབང་པོ་དང་། རང་བཞིན་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་ཀྱི་སྒོ་མོ་བརྒྱ་སྟོང་དུ་མ་བསྟན་ནས་ཐམས་ཅད་རབ་ཏུ་གསལ་བར་རྟོགས་པར་བྱེད་དེ།
en: In the same way, the bodhisattvas, since they know the dharmadhātu very well, show, by means of their effortless knowledge, many hundreds of thousands of Dharma doors according to the faculties and natures of these beings, who have accumulated foolish actions, and make them understand everything clearly.

source: གློག་ཐོབ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་གཏི་མུག་སྤྱོད་པའི་གཏེར་ཞེས་བྱའོ། །
en: “Vidyutprāpta, this is the bodhisattva mahāsattvas’ treasure for those with a deluded temperament.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་གིས་གཏེར་འདི་ཐོབ་པར་གྱུར་ན་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཤིན་ཏུ་ལེགས་པར་སོ་སོར་བརྟགས་ནས་གཏི་མུག་སྤྱོད་པའི་སེམས་ཅན་དེ་དག་གི་ཆེད་དུ་བསྐལ་པའམ། བསྐལ་པ་ལས་ལྷག་པར་དེ་དག་གི་རང་བཞིན་དང་། འདུན་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཚིག་འབྲུ་དང་། ཡི་གེ་དང་། བརྗོད་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་ཐབས་མཁས་པས་ཆོས་སྟོན་པར་བྱེད་ཀྱང་གཏི་མུག་སྤྱོད་པའི་མཐའ་ཡང་རྙེད་པར་མི་འགྱུར་ལ།
en: When bodhisattvas obtain this treasure, having correctly contemplated conditioned origination, for the sake of those sentient beings with a deluded temperament, for a kalpa or more than a kalpa, according to their natures and wishes, they teach the Dharma with skill in means through various words, letters, and expressions.

source: བྱང་ཆུབ་སེམས་དཔའ་དེའི་ཤེས་རབ་དང་སྤོབས་པ་ཡང་གཏུགས་པར་མི་འགྱུར་ཏེ།
en: Furthermore, although deluded actions are endless, the bodhisattvas’ wisdom and courage also cannot be exhausted.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཐམས་ཅད་དབྱེར་མེད་པའི་མཚན་ཉིད་ལེགས་པར་བཤད་པས་ཐོབ་པའི་གཏི་མུག་སྤྱོད་པའི་གཏེར་ཞེས་བྱའོ། །
en: As for this, it should be understood as the bodhisattvas’ treasure for those of deluded temperament, which they have obtained by explaining well the undifferentiated nature of all dharmas.

source: འདི་ལྟར་གཏི་མུག་གི་སྤྱོད་པ་ཉི་ཁྲི་ཆིག་སྟོང་དང་། སྤྱོད་པ་གཞན་གཏོགས་པར་བརྒྱད་ཁྲི་བཞི་སྟོང་དུ་གྱུར་པ་དེ་དག་བྱང་ཆུབ་སེམས་དཔས་ཡོངས་སུ་སྤང་བའི་ཕྱིར་ཆོས་ཀྱི་སྒོ་མོ་བརྒྱ་སྟོང་དུ་མ་རབ་ཏུ་ཕྱེ་ནས་ཡང་དག་པར་སྟོན་པ་གང་ཡིན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་གཏི་མུག་སྤྱོད་པའི་གཏེར་ཅེས་བྱའོ། །
en: Thus, as for those twenty-one thousand deluded actions and actions belonging to the other categories of temperaments, making a total of eighty-four thousand, the bodhisattvas, for the sake of eliminating them, having distinguished many hundreds and thousands of Dharma doors, teach them correctly. This is called the bodhisattvas’ treasure for those with a deluded temperament.

source: གཞན་ཡང་གློག་ཐོབ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཆ་མཉམ་པའི་སྤྱོད་པའི་གཏེར་ཞེས་བྱ་བ་ཇི་ལྟ་བུ་ཡིན་ཞེ་ན།
en: “Furthermore, Vidyutprāpta, what is the bodhisattva mahāsattvas’ treasure for those with an equally proportioned temperament?

source: འདི་ལྟ་སྟེ་དཔེར་ན་མེ་ལོང་གི་དཀྱིལ་འཁོར་ཤིན་ཏུ་དག་ཅིང་ཡོངས་སུ་གསལ་བ་དྲི་མ་མེད་པ་ལམ་གྱི་བཞི་མདོར་བཞག་ན་གཟུགས་བརྙན་རྣམས་དེར་སྣང་ཞིང་འཕེལ་བ་དང་འགྲིབ་པ་མེད་ཀྱང་མེ་ལོང་གི་དཀྱིལ་འཁོར་དེ་བདག་གིས་གཟུགས་བརྙན་རྣམ་པ་སྣ་ཚོགས་འདི་དག་སྟོན་པར་བྱེད་དོ་ཞེས་མི་སེམས་མོད་ཀྱི།
en: To give an analogy, it is like this. When a very clean, completely clear, spotless round mirror is placed at a crossroads, although reflections appear there without increase or diminishment, the round mirror does not think, ‘I made these various types of reflections.’

source: འོན་ཀྱང་མེ་ལོང་གི་དཀྱིལ་འཁོར་དེ་ཤིན་ཏུ་ལེགས་པར་བྱི་དོར་བྱས་ན་གཟུགས་བརྙན་གྱི་རྣམ་པ་ཐམས་ཅད་རང་གི་ངང་གིས་རབ་ཏུ་སྣང་བར་འགྱུར་རོ། །
en: Nevertheless, if that round mirror is wiped well, all the reflections will spontaneously appear.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་ཆོས་ཀྱི་དབྱིངས་ཀྱི་མེ་ལོང་གི་དཀྱིལ་འཁོར་ཤིན་ཏུ་ལེགས་པར་བྱི་དོར་བྱས་པས་རྩོལ་བ་མེད་པའི་ཏིང་ངེ་འཛིན་ལ་གནས་ནས་སེམས་ཅན་རྣམས་ཀྱི་སེམས་ཀྱི་སྤྱོད་པའི་བྱེ་བྲག་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་ཀྱི་སྒོ་མོ་བརྒྱ་སྟོང་དུ་མ་རྣམ་པར་ཕྱེ་སྟེ་བསྟན་ནས་དེ་དག་ཐམས་ཅད་རབ་ཏུ་རྟོགས་ཤིང་རྣམ་པར་གྲོལ་བ་ཐོབ་པར་བྱས་ཀྱང་ཆོས་ཀྱི་མཚན་མ་དང་སེམས་ཅན་གྱི་མཚན་མ་སྐྱེད་པར་མི་བྱེད་དོ། །
en: In the same way, the bodhisattvas, by wiping well the round mirror of the dharmadhātu, established in effortless samādhi, open many hundreds of thousands of Dharma doors and teach according to the differences in sentient beings’ mental actions. All those sentient beings, understanding completely, obtain liberation. But they do not produce a concept of dharmas or a concept of sentient beings.
